# -*- coding: utf-8 -*-


class LunarUtil:
    """
    农历工具，基准日期为1900年十一月十一，对应阳历1901年1月1日，最远仅支持到2099年
    """

    BASE_YEAR = 1900
    BASE_MONTH = 11
    BASE_DAY = 11
    BASE_INDEX = 0
    BASE_YEAR_GAN_ZHI_INDEX = -4
    BASE_DAY_GAN_ZHI_INDEX = 15
    BASE_MONTH_ZHI_INDEX = 2
    BASE_WEEK_INDEX = 2
    LEAP_MONTH_YEAR = (6, 14, 19, 25, 33, 36, 38, 41, 44, 52, 55, 79, 117, 136, 147, 150, 155, 158, 185, 193)
    LUNAR_MONTH = (0x00, 0x04, 0xad, 0x08, 0x5a, 0x01, 0xd5, 0x54, 0xb4, 0x09, 0x64, 0x05, 0x59, 0x45, 0x95, 0x0a, 0xa6, 0x04, 0x55, 0x24, 0xad, 0x08, 0x5a, 0x62, 0xda, 0x04, 0xb4, 0x05, 0xb4, 0x55, 0x52, 0x0d, 0x94, 0x0a, 0x4a, 0x2a, 0x56, 0x02, 0x6d, 0x71, 0x6d, 0x01, 0xda, 0x02, 0xd2, 0x52, 0xa9, 0x05, 0x49, 0x0d, 0x2a, 0x45, 0x2b, 0x09, 0x56, 0x01, 0xb5, 0x20, 0x6d, 0x01, 0x59, 0x69, 0xd4, 0x0a, 0xa8, 0x05, 0xa9, 0x56, 0xa5, 0x04, 0x2b, 0x09, 0x9e, 0x38, 0xb6, 0x08, 0xec, 0x74, 0x6c, 0x05, 0xd4, 0x0a, 0xe4, 0x6a, 0x52, 0x05, 0x95, 0x0a, 0x5a, 0x42, 0x5b, 0x04, 0xb6, 0x04, 0xb4, 0x22, 0x6a, 0x05, 0x52, 0x75, 0xc9, 0x0a, 0x52, 0x05, 0x35, 0x55, 0x4d, 0x0a, 0x5a, 0x02, 0x5d, 0x31, 0xb5, 0x02, 0x6a, 0x8a, 0x68, 0x05, 0xa9, 0x0a, 0x8a, 0x6a, 0x2a, 0x05, 0x2d, 0x09, 0xaa, 0x48, 0x5a, 0x01,
                   0xb5, 0x09, 0xb0, 0x39, 0x64, 0x05, 0x25, 0x75, 0x95, 0x0a, 0x96, 0x04, 0x4d, 0x54, 0xad, 0x04, 0xda, 0x04, 0xd4, 0x44, 0xb4, 0x05, 0x54, 0x85, 0x52, 0x0d, 0x92, 0x0a, 0x56, 0x6a, 0x56, 0x02, 0x6d, 0x02, 0x6a, 0x41, 0xda, 0x02, 0xb2, 0xa1, 0xa9, 0x05, 0x49, 0x0d, 0x0a, 0x6d, 0x2a, 0x09, 0x56, 0x01, 0xad, 0x50, 0x6d, 0x01, 0xd9, 0x02, 0xd1, 0x3a, 0xa8, 0x05, 0x29, 0x85, 0xa5, 0x0c, 0x2a, 0x09, 0x96, 0x54, 0xb6, 0x08, 0x6c, 0x09, 0x64, 0x45, 0xd4, 0x0a, 0xa4, 0x05, 0x51, 0x25, 0x95, 0x0a, 0x2a, 0x72, 0x5b, 0x04, 0xb6, 0x04, 0xac, 0x52, 0x6a, 0x05, 0xd2, 0x0a, 0xa2, 0x4a, 0x4a, 0x05, 0x55, 0x94, 0x2d, 0x0a, 0x5a, 0x02, 0x75, 0x61, 0xb5, 0x02, 0x6a, 0x03, 0x61, 0x45, 0xa9, 0x0a, 0x4a, 0x05, 0x25, 0x25, 0x2d, 0x09, 0x9a, 0x68, 0xda, 0x08, 0xb4, 0x09, 0xa8, 0x59, 0x54, 0x03,
                   0xa5, 0x0a, 0x91, 0x3a, 0x96, 0x04, 0xad, 0xb0, 0xad, 0x04, 0xda, 0x04, 0xf4, 0x62, 0xb4, 0x05, 0x54, 0x0b, 0x44, 0x5d, 0x52, 0x0a, 0x95, 0x04, 0x55, 0x22, 0x6d, 0x02, 0x5a, 0x71, 0xda, 0x02, 0xaa, 0x05, 0xb2, 0x55, 0x49, 0x0b, 0x4a, 0x0a, 0x2d, 0x39, 0x36, 0x01, 0x6d, 0x80, 0x6d, 0x01, 0xd9, 0x02, 0xe9, 0x6a, 0xa8, 0x05, 0x29, 0x0b, 0x9a, 0x4c, 0xaa, 0x08, 0xb6, 0x08, 0xb4, 0x38, 0x6c, 0x09, 0x54, 0x75, 0xd4, 0x0a, 0xa4, 0x05, 0x45, 0x55, 0x95, 0x0a, 0x9a, 0x04, 0x55, 0x44, 0xb5, 0x04, 0x6a, 0x82, 0x6a, 0x05, 0xd2, 0x0a, 0x92, 0x6a, 0x4a, 0x05, 0x55, 0x0a, 0x2a, 0x4a, 0x5a, 0x02, 0xb5, 0x02, 0xb2, 0x31, 0x69, 0x03, 0x31, 0x73, 0xa9, 0x0a, 0x4a, 0x05, 0x2d, 0x55, 0x2d, 0x09, 0x5a, 0x01, 0xd5, 0x48, 0xb4, 0x09, 0x68, 0x89, 0x54, 0x0b, 0xa4, 0x0a, 0xa5, 0x6a, 0x95, 0x04,
                   0xad, 0x08, 0x6a, 0x44, 0xda, 0x04, 0x74, 0x05, 0xb0, 0x25, 0x54, 0x03)
    GAN = ("", "甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸")
    POSITION_XI = ("", "艮", "乾", "坤", "离", "巽", "艮", "乾", "坤", "离", "巽")
    POSITION_YANG_GUI = ("", "坤", "坤", "兑", "乾", "艮", "坎", "离", "艮", "震", "巽")
    POSITION_YIN_GUI = ("", "艮", "坎", "乾", "兑", "坤", "坤", "艮", "离", "巽", "震")
    POSITION_FU = ("", "巽", "巽", "震", "震", "坎", "离", "坤", "坤", "乾", "兑")
    POSITION_CAI = ("", "艮", "艮", "坤", "坤", "坎", "坎", "震", "震", "离", "离")
    POSITION_TAI_DAY = ("占门碓外东南", "碓磨厕外东南", "厨灶炉外正南", "仓库门外正南", "房床厕外正南", "占门床外正南", "占碓磨外正南", "厨灶厕外西南", "仓库炉外西南", "房床门外西南", "门鸡栖外西南", "碓磨床外西南", "厨灶碓外西南", "仓库厕外西南", "房床厕外正南", "房床炉外正西", "碓磨栖外正西", "厨灶床外正西", "仓库碓外西北", "房床厕外西北", "占门炉外西北", "碓磨门外西北", "厨灶栖外西北", "仓库床外西北", "房床碓外正北", "占门厕外正北", "碓磨炉外正北", "厨灶门外正北", "仓库栖外正北", "占房床房内北", "占门碓房内北", "碓磨厕房内北", "厨灶炉房内北", "仓库门房内北", "门鸡栖外西南", "占门床房内南", "占碓磨房内南", "厨灶厕房内南", "仓库炉房内南", "房床门房内南", "门鸡栖房内东", "碓磨床房内东", "厨灶碓房内东", "仓库厕房内东", "房床炉房内东", "占大门外东北", "碓磨栖外东北", "厨灶床外东北", "仓库碓外东北", "房床厕外东北", "占门炉外东北", "碓磨门外正东", "厨灶栖外正东", "仓库床外正东", "房床碓外正东", "占门厕外正东", "碓磨炉外东南", "仓库栖外东南", "占房床外东南", "占门碓外东南")
    POSITION_TAI_MONTH = ("占房床", "占户窗", "占门堂", "占厨灶", "占身床", "占床仓", "占碓磨", "占厕户", "占门房", "占房床", "占炉灶", "占房床")
    ZHI = ("", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥")
    JIA_ZI = ("甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥")
    ZHI_XING = ("", "建", "除", "满", "平", "定", "执", "破", "危", "成", "收", "开", "闭")
    TIAN_SHEN = ("", "青龙", "明堂", "天刑", "朱雀", "金匮", "天德", "白虎", "玉堂", "天牢", "玄武", "司命", "勾陈")
    MONTH_ZHI_TIAN_SHEN_OFFSET = {
        "子": 4,
        "丑": 2,
        "寅": 0,
        "卯": 10,
        "辰": 8,
        "巳": 6,
        "午": 4,
        "未": 2,
        "申": 0,
        "酉": 10,
        "戌": 8,
        "亥": 6
    }
    TIAN_SHEN_TYPE = {
        "青龙": "黄道",
        "明堂": "黄道",
        "金匮": "黄道",
        "天德": "黄道",
        "玉堂": "黄道",
        "司命": "黄道",

        "天刑": "黑道",
        "朱雀": "黄道",
        "白虎": "黄道",
        "天牢": "黄道",
        "玄武": "黄道",
        "勾陈": "黄道"
    }

    TIAN_SHEN_TYPE_LUCK = {
        "黄道": "吉",
        "黑道": "凶"
    }

    PENG_ZU_GAN = ("", "甲不开仓财物耗散", "乙不栽植千株不长", "丙不修灶必见灾殃", "丁不剃头头必生疮", "戊不受田田主不祥", "己不破券二比并亡", "庚不经络织机虚张", "辛不合酱主人不尝", "壬不泱水更难提防", "癸不词讼理弱敌强")
    PENG_ZU_ZHI = ("", "子不问卜自惹祸殃", "丑不冠带主不还乡", "寅不祭祀神鬼不尝", "卯不穿井水泉不香", "辰不哭泣必主重丧", "巳不远行财物伏藏", "午不苫盖屋主更张", "未不服药毒气入肠", "申不安床鬼祟入房", "酉不会客醉坐颠狂", "戌不吃犬作怪上床", "亥不嫁娶不利新郎")
    NUMBER = ("零", "壹", "贰", "叁", "肆", "伍", "陆", "柒", "捌", "玖")
    MONTH = ("", "正", "贰", "叁", "肆", "伍", "陆", "柒", "捌", "玖", "拾", "冬", "腊")
    SEASON = ("", "孟春", "仲春", "季春", "孟夏", "仲夏", "季夏", "孟秋", "仲秋", "季秋", "孟冬", "仲冬", "季冬")
    SHENGXIAO = ("", "鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪")
    QI = ("大寒", "雨水", "春分", "谷雨", "小满", "夏至", "大暑", "处暑", "秋分", "霜降", "小雪", "冬至")
    JIE = ("小寒", "立春", "惊蛰", "清明", "立夏", "芒种", "小暑", "立秋", "白露", "寒露", "立冬", "大雪")
    DAY = ("", "初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十")

    FESTIVAL = {
        "1-1": "春节",
        "1-15": "元宵节",
        "2-2": "龙头节",
        "5-5": "端午节",
        "7-7": "七夕节",
        "8-15": "中秋节",
        "9-9": "重阳节",
        "12-8": "腊八节",
        "12-30": "除夕"
    }

    OTHER_FESTIVAL = {
        "1-1": ["弥勒佛圣诞"],
        "1-8": ["五殿阎罗天子诞"],
        "1-9": ["玉皇上帝诞"],
        "2-1": ["一殿秦广王诞"],
        "2-2": ["福德土地正神诞"],
        "2-3": ["文昌帝君诞"],
        "2-6": ["东华帝君诞"],
        "2-8": ["释迦牟尼佛出家"],
        "2-15": ["释迦牟尼佛般涅槃"],
        "2-17": ["东方杜将军诞"],
        "2-18": ["至圣先师孔子讳辰"],
        "2-19": ["观音大士诞"],
        "2-21": ["普贤菩萨诞"],
        "3-1": ["二殿楚江王诞"],
        "3-3": ["玄天上帝诞"],
        "3-8": ["六殿卞城王诞"],
        "3-15": ["昊天上帝诞"],
        "3-16": ["准提菩萨诞"],
        "3-19": ["中岳大帝诞"],
        "3-20": ["子孙娘娘诞"],
        "3-27": ["七殿泰山王诞"],
        "3-28": ["苍颉至圣先师诞"],
        "4-1": ["八殿都市王诞"],
        "4-4": ["文殊菩萨诞"],
        "4-8": ["释迦牟尼佛诞"],
        "4-14": ["纯阳祖师诞"],
        "4-15": ["钟离祖师诞"],
        "4-17": ["十殿转轮王诞"],
        "4-18": ["紫徽大帝诞"],
        "4-20": ["眼光圣母诞"],
        "5-1": ["南极长生大帝诞"],
        "5-8": ["南方五道诞"],
        "5-11": ["天下都城隍诞"],
        "5-12": ["炳灵公诞"],
        "5-13": ["关圣降"],
        "5-16": ["天地元气造化万物之辰"],
        "5-18": ["张天师诞"],
        "5-22": ["孝娥神诞"],
        "6-19": ["观世音菩萨成道日"],
        "6-24": ["关帝诞"],
        "7-7": ["魁星诞"],
        "7-13": ["长真谭真人诞", "大势至菩萨诞"],
        "7-15": ["中元节"],
        "7-18": ["西王母诞"],
        "7-19": ["太岁诞"],
        "7-22": ["增福财神诞"],
        "7-29": ["杨公忌"],
        "7-30": ["地藏菩萨诞"],
        "8-1": ["许真君诞"],
        "8-3": ["司命灶君诞"],
        "8-5": ["雷声大帝诞"],
        "8-10": ["北斗大帝诞"],
        "8-12": ["西方五道诞"],
        "8-16": ["天曹掠刷真君降"],
        "8-18": ["天人兴福之辰"],
        "8-23": ["汉恒候张显王诞"],
        "8-24": ["灶君夫人诞"],
        "8-29": ["至圣先师孔子诞"],
        "9-1": ["北斗九星降世"],
        "9-3": ["五瘟神诞"],
        "9-9": ["酆都大帝诞"],
        "9-13": ["孟婆尊神诞"],
        "9-17": ["金龙四大王诞"],
        "9-19": ["观世音菩萨出家"],
        "9-30": ["药师琉璃光佛诞"],
        "10-1": ["寒衣节"],
        "10-3": ["三茅诞"],
        "10-5": ["达摩祖师诞"],
        "10-8": ["佛涅槃日"],
        "10-15": ["下元节"],
        "11-4": ["至圣先师孔子诞"],
        "11-6": ["西岳大帝诞"],
        "11-11": ["太乙救苦天尊诞"],
        "11-17": ["阿弥陀佛诞"],
        "11-19": ["太阳日宫诞"],
        "11-23": ["张仙诞"],
        "11-26": ["北方五道诞"],
        "12-8": ["释迦如来成佛之辰"],
        "12-16": ["南岳大帝诞"],
        "12-21": ["天猷上帝诞"],
        "12-23": ["小年"],
        "12-24": ["子时灶君上天朝玉帝"],
        "12-29": ["华严菩萨诞"]
    }

    XIU = {
        "申1": "毕",
        "申2": "翼",
        "申3": "箕",
        "申4": "奎",
        "申5": "鬼",
        "申6": "氐",
        "申0": "虚",

        "子1": "毕",
        "子2": "翼",
        "子3": "箕",
        "子4": "奎",
        "子5": "鬼",
        "子6": "氐",
        "子0": "虚",

        "辰1": "毕",
        "辰2": "翼",
        "辰3": "箕",
        "辰4": "奎",
        "辰5": "鬼",
        "辰6": "氐",
        "辰0": "虚",

        "巳1": "危",
        "巳2": "觜",
        "巳3": "轸",
        "巳4": "斗",
        "巳5": "娄",
        "巳6": "柳",
        "巳0": "房",

        "酉1": "危",
        "酉2": "觜",
        "酉3": "轸",
        "酉4": "斗",
        "酉5": "娄",
        "酉6": "柳",
        "酉0": "房",

        "丑1": "危",
        "丑2": "觜",
        "丑3": "轸",
        "丑4": "斗",
        "丑5": "娄",
        "丑6": "柳",
        "丑0": "房",

        "寅1": "心",
        "寅2": "室",
        "寅3": "参",
        "寅4": "角",
        "寅5": "牛",
        "寅6": "胃",
        "寅0": "星",

        "午1": "心",
        "午2": "室",
        "午3": "参",
        "午4": "角",
        "午5": "牛",
        "午6": "胃",
        "午0": "星",

        "戌1": "心",
        "戌2": "室",
        "戌3": "参",
        "戌4": "角",
        "戌5": "牛",
        "戌6": "胃",
        "戌0": "星",

        "亥1": "张",
        "亥2": "尾",
        "亥3": "壁",
        "亥4": "井",
        "亥5": "亢",
        "亥6": "女",
        "亥0": "昴",

        "卯1": "张",
        "卯2": "尾",
        "卯3": "壁",
        "卯4": "井",
        "卯5": "亢",
        "卯6": "女",
        "卯0": "昴",

        "未1": "张",
        "未2": "尾",
        "未3": "壁",
        "未4": "井",
        "未5": "亢",
        "未6": "女",
        "未0": "昴"
    }

    XIU_LUCK = {
        "角": "吉",
        "亢": "凶",
        "氐": "凶",
        "房": "吉",
        "心": "凶",
        "尾": "吉",
        "箕": "吉",
        "斗": "吉",
        "牛": "凶",
        "女": "凶",
        "虚": "凶",
        "危": "凶",
        "室": "吉",
        "壁": "吉",
        "奎": "凶",
        "娄": "吉",
        "胃": "吉",
        "昴": "凶",
        "毕": "吉",
        "觜": "凶",
        "参": "吉",
        "井": "吉",
        "鬼": "凶",
        "柳": "凶",
        "星": "凶",
        "张": "吉",
        "翼": "凶",
        "轸": "吉"
    }

    XIU_SONG = {
        "角": "角星造作主荣昌，外进田财及女郎，嫁娶婚姻出贵子，文人及第见君王，惟有埋葬不可用，三年之后主瘟疫，起工修筑坟基地，堂前立见主人凶。",
        "亢": "亢星造作长房当，十日之中主有殃，田地消磨官失职，接运定是虎狼伤，嫁娶婚姻用此日，儿孙新妇守空房，埋葬若还用此日，当时害祸主重伤。",
        "氐": "氐星造作主灾凶，费尽田园仓库空，埋葬不可用此日，悬绳吊颈祸重重，若是婚姻离别散，夜招浪子入房中，行船必定遭沉没，更生聋哑子孙穷。",
        "房": "房星造作田园进，钱财牛马遍山岗，更招外处田庄宅，荣华富贵福禄康，埋葬若然用此日，高官进职拜君王，嫁娶嫦娥至月殿，三年抱子至朝堂。",
        "心": "心星造作大为凶，更遭刑讼狱囚中，忤逆官非宅产退，埋葬卒暴死相从，婚姻若是用此日，子死儿亡泪满胸，三年之内连遭祸，事事教君没始终。",
        "尾": "尾星造作主天恩，富贵荣华福禄增，招财进宝兴家宅，和合婚姻贵子孙，埋葬若能依此日，男清女正子孙兴，开门放水招田宅，代代公侯远播名。",
        "箕": "箕星造作主高强，岁岁年年大吉昌，埋葬修坟大吉利，田蚕牛马遍山岗，开门放水招田宅，箧满金银谷满仓，福荫高官加禄位，六亲丰禄乐安康。",
        "斗": "斗星造作主招财，文武官员位鼎台，田宅家财千万进，坟堂修筑贵富来，开门放水招牛马，旺蚕男女主和谐，遇此吉宿来照护，时支福庆永无灾。",
        "牛": "牛星造作主灾危，九横三灾不可推，家宅不安人口退，田蚕不利主人衰，嫁娶婚姻皆自损，金银财谷渐无之，若是开门并放水，牛猪羊马亦伤悲。",
        "女": "女星造作损婆娘，兄弟相嫌似虎狼，埋葬生灾逢鬼怪，颠邪疾病主瘟惶，为事遭官财失散，泻利留连不可当，开门放水用此日，全家财散主离乡。",
        "虚": "虚星造作主灾殃，男女孤眠不一双，内乱风声无礼节，儿孙媳妇伴人床，开门放水遭灾祸，虎咬蛇伤又卒亡，三三五五连年病，家破人亡不可当。",
        "危": "危星不可造高楼，自遭刑吊见血光，三年孩子遭水厄，后生出外永不还，埋葬若还逢此日，周年百日取高堂，三年两载一悲伤，开门放水到官堂。",
        "室": "室星修造进田牛，儿孙代代近王侯，家贵荣华天上至，寿如彭祖八千秋，开门放水招财帛，和合婚姻生贵儿，埋葬若能依此日，门庭兴旺福无休。",
        "壁": "壁星造作主增财，丝蚕大熟福滔天，奴婢自来人口进，开门放水出英贤，埋葬招财官品进，家中诸事乐陶然，婚姻吉利主贵子，早播名誉著祖鞭。",
        "奎": "奎星造作得祯祥，家内荣和大吉昌，若是埋葬阴卒死，当年定主两三伤，看看军令刑伤到，重重官事主瘟惶，开门放水遭灾祸，三年两次损儿郎。",
        "娄": "娄星修造起门庭，财旺家和事事兴，外进钱财百日进，一家兄弟播高名，婚姻进益生贵子，玉帛金银箱满盈，放水开门皆吉利，男荣女贵寿康宁。",
        "胃": "胃星造作事如何，家贵荣华喜气多，埋葬贵临官禄位，夫妇齐眉永保康，婚姻遇此家富贵，三灾九祸不逢他，从此门前多吉庆，儿孙代代拜金阶。",
        "昴": "昴星造作进田牛，埋葬官灾不得休，重丧二日三人死，尽卖田园不记增，开门放水招灾祸，三岁孩儿白了头，婚姻不可逢此日，死别生离是可愁。",
        "毕": "毕星造作主光前，买得田园有余钱，埋葬此日添官职，田蚕大熟永丰年，开门放水多吉庆，合家人口得安然，婚姻若得逢此日，生得孩儿福寿全。",
        "觜": "觜星造作有徒刑，三年必定主伶丁，埋葬卒死多因此，取定寅年使杀人，三丧不止皆由此，一人药毒二人身，家门田地皆退败，仓库金银化作尘。",
        "参": "参星造作旺人家，文星照耀大光华，只因造作田财旺，埋葬招疾哭黄沙，开门放水加官职，房房子孙见田加，婚姻许遁遭刑克，男女朝开幕落花。",
        "井": "井星造作旺蚕田，金榜题名第一光，埋葬须防惊卒死，狂颠风疾入黄泉，开门放水招财帛，牛马猪羊旺莫言，贵人田塘来入宅，儿孙兴旺有余钱。",
        "鬼": "鬼星起造卒人亡，堂前不见主人郎，埋葬此日官禄至，儿孙代代近君王，开门放水须伤死，嫁娶夫妻不久长，修土筑墙伤产女，手扶双女泪汪汪。",
        "柳": "柳星造作主遭官，昼夜偷闭不暂安，埋葬瘟惶多疾病，田园退尽守冬寒，开门放水遭聋瞎，腰驼背曲似弓弯，更有棒刑宜谨慎，妇人随客走盘桓。",
        "星": "星宿日好造新房，进职加官近帝王，不可埋葬并放水，凶星临位女人亡，生离死别无心恋，要自归休别嫁郎，孔子九曲殊难度，放水开门天命伤。",
        "张": "张星日好造龙轩，年年并见进庄田，埋葬不久升官职，代代为官近帝前，开门放水招财帛，婚姻和合福绵绵，田蚕人满仓库满，百般顺意自安然。",
        "翼": "翼星不利架高堂，三年二载见瘟惶，埋葬若还逢此日，子孙必定走他乡，婚姻此日不宜利，归家定是不相当，开门放水家须破，少女恋花贪外郎。",
        "轸": "轸星临水造龙宫，代代为官受皇封，富贵荣华增寿禄，库满仓盈自昌隆，埋葬文昌来照助，宅舍安宁不见凶，更有为官沾帝宠，婚姻龙子入龙宫。"
    }

    SHOU = {
        "东": "青龙",
        "南": "朱雀",
        "西": "白虎",
        "北": "玄武"
    }

    CHONG = ("", "午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳")

    CHONG_GAN = ("", "戊", "己", "庚", "辛", "壬", "癸", "甲", "乙", "丙", "丁")
    CHONG_GAN_BAD = {
        "庚": "甲",
        "辛": "乙",
        "壬": "丙",
        "癸": "丁"
    }

    CHONG_GAN_TIE = ("", "己", "戊", "辛", "庚", "癸", "壬", "乙", "甲", "丁", "丙")
    CHONG_GAN_TIE_GOOD = {
        "甲": "己",
        "丙": "辛",
        "戊": "癸",
        "庚": "乙",
        "壬": "丁"
    }

    SHA = {
        "子": "南",
        "丑": "东",
        "寅": "北",
        "卯": "西",
        "辰": "南",
        "巳": "东",
        "午": "北",
        "未": "西",
        "申": "南",
        "酉": "东",
        "戌": "北",
        "亥": "西"
    }

    POSITION_DESC = {
        "坎": "正北",
        "艮": "东北",
        "震": "正东",
        "巽": "东南",
        "离": "正南",
        "坤": "西南",
        "兑": "正西",
        "乾": "西北"
    }

    GONG = {
        "角": "东",
        "井": "南",
        "奎": "西",
        "斗": "北",
        "亢": "东",
        "鬼": "南",
        "娄": "西",
        "牛": "北",
        "氐": "南",
        "柳": "南",
        "胃": "西",
        "女": "北",
        "房": "东",
        "星": "南",
        "昴": "西",
        "虚": "北",
        "心": "东",
        "张": "南",
        "毕": "西",
        "危": "北",
        "尾": "东",
        "翼": "南",
        "觜": "西",
        "室": "北",
        "箕": "东",
        "轸": "南",
        "参": "西",
        "壁": "北"
    }

    ZHENG = {
        "角": "木",
        "井": "木",
        "奎": "木",
        "斗": "木",
        "亢": "金",
        "鬼": "金",
        "娄": "金",
        "牛": "金",
        "氐": "土",
        "柳": "土",
        "胃": "土",
        "女": "土",
        "房": "日",
        "星": "日",
        "昴": "日",
        "虚": "日",
        "心": "月",
        "张": "月",
        "毕": "月",
        "危": "月",
        "尾": "火",
        "翼": "火",
        "觜": "火",
        "室": "火",
        "箕": "水",
        "轸": "水",
        "参": "水",
        "壁": "水"
    }

    ANIMAL = {
        "角": "蛟",
        "斗": "獬",
        "奎": "狼",
        "井": "犴",
        "亢": "龙",
        "牛": "牛",
        "娄": "狗",
        "鬼": "羊",
        "女": "蝠",
        "氐": "貉",
        "胃": "彘",
        "柳": "獐",
        "房": "兔",
        "虚": "鼠",
        "昴": "鸡",
        "星": "马",
        "心": "狐",
        "危": "燕",
        "毕": "乌",
        "张": "鹿",
        "尾": "虎",
        "室": "猪",
        "觜": "猴",
        "翼": "蛇",
        "箕": "豹",
        "壁": "獝",
        "参": "猿",
        "轸": "蚓"
    }

    WU_XING_GAN = {
        "甲": "木",
        "乙": "木",
        "丙": "火",
        "丁": "火",
        "戊": "土",
        "己": "土",
        "庚": "金",
        "辛": "金",
        "壬": "水",
        "癸": "水"
    }

    WU_XING_ZHI = {
        "寅": "木",
        "卯": "木",
        "巳": "火",
        "午": "火",
        "辰": "土",
        "丑": "土",
        "戌": "土",
        "未": "土",
        "申": "金",
        "酉": "金",
        "亥": "水",
        "子": "水"
    }

    NAYIN = {
        "甲子": "海中金",
        "甲午": "沙中金",
        "丙寅": "炉中火",
        "丙申": "山下火",
        "戊辰": "大林木",
        "戊戌": "平地木",
        "庚午": "路旁土",
        "庚子": "壁上土",
        "壬申": "剑锋金",
        "壬寅": "金箔金",
        "甲戌": "山头火",
        "甲辰": "覆灯火",
        "丙子": "涧下水",
        "丙午": "天河水",
        "戊寅": "城头土",
        "戊申": "大驿土",
        "庚辰": "白蜡金",
        "庚戌": "钗钏金",
        "壬午": "杨柳木",
        "壬子": "桑柘木",
        "甲申": "泉中水",
        "甲寅": "大溪水",
        "丙戌": "屋上土",
        "丙辰": "沙中土",
        "戊子": "霹雳火",
        "戊午": "天上火",
        "庚寅": "松柏木",
        "庚申": "石榴木",
        "壬辰": "长流水",
        "壬戌": "大海水",
        "乙丑": "海中金",
        "乙未": "沙中金",
        "丁卯": "炉中火",
        "丁酉": "山下火",
        "己巳": "大林木",
        "己亥": "平地木",
        "辛未": "路旁土",
        "辛丑": "壁上土",
        "癸酉": "剑锋金",
        "癸卯": "金箔金",
        "乙亥": "山头火",
        "乙巳": "覆灯火",
        "丁丑": "涧下水",
        "丁未": "天河水",
        "己卯": "城头土",
        "己酉": "大驿土",
        "辛巳": "白蜡金",
        "辛亥": "钗钏金",
        "癸未": "杨柳木",
        "癸丑": "桑柘木",
        "乙酉": "泉中水",
        "乙卯": "大溪水",
        "丁亥": "屋上土",
        "丁巳": "沙中土",
        "己丑": "霹雳火",
        "己未": "天上火",
        "辛卯": "松柏木",
        "辛酉": "石榴木",
        "癸巳": "长流水",
        "癸亥": "大海水"
    }

    SHI_SHEN_GAN = {
        "甲甲": "比肩",
        "甲乙": "劫财",
        "甲丙": "食神",
        "甲丁": "伤官",
        "甲戊": "偏财",
        "甲己": "正财",
        "甲庚": "七杀",
        "甲辛": "正官",
        "甲壬": "偏印",
        "甲癸": "正印",
        "乙乙": "比肩",
        "乙甲": "劫财",
        "乙丁": "食神",
        "乙丙": "伤官",
        "乙己": "偏财",
        "乙戊": "正财",
        "乙辛": "七杀",
        "乙庚": "正官",
        "乙癸": "偏印",
        "乙壬": "正印",
        "丙丙": "比肩",
        "丙丁": "劫财",
        "丙戊": "食神",
        "丙己": "伤官",
        "丙庚": "偏财",
        "丙辛": "正财",
        "丙壬": "七杀",
        "丙癸": "正官",
        "丙甲": "偏印",
        "丙乙": "正印",
        "丁丁": "比肩",
        "丁丙": "劫财",
        "丁己": "食神",
        "丁戊": "伤官",
        "丁辛": "偏财",
        "丁庚": "正财",
        "丁癸": "七杀",
        "丁壬": "正官",
        "丁乙": "偏印",
        "丁甲": "正印",
        "戊戊": "比肩",
        "戊己": "劫财",
        "戊庚": "食神",
        "戊辛": "伤官",
        "戊壬": "偏财",
        "戊癸": "正财",
        "戊甲": "七杀",
        "戊乙": "正官",
        "戊丙": "偏印",
        "戊丁": "正印",
        "己己": "比肩",
        "己戊": "劫财",
        "己辛": "食神",
        "己庚": "伤官",
        "己癸": "偏财",
        "己壬": "正财",
        "己乙": "七杀",
        "己甲": "正官",
        "己丁": "偏印",
        "己丙": "正印",
        "庚庚": "比肩",
        "庚辛": "劫财",
        "庚壬": "食神",
        "庚癸": "伤官",
        "庚甲": "偏财",
        "庚乙": "正财",
        "庚丙": "七杀",
        "庚丁": "正官",
        "庚戊": "偏印",
        "庚己": "正印",
        "辛辛": "比肩",
        "辛庚": "劫财",
        "辛癸": "食神",
        "辛壬": "伤官",
        "辛乙": "偏财",
        "辛甲": "正财",
        "辛丁": "七杀",
        "辛丙": "正官",
        "辛己": "偏印",
        "辛戊": "正印",
        "壬壬": "比肩",
        "壬癸": "劫财",
        "壬甲": "食神",
        "壬乙": "伤官",
        "壬丙": "偏财",
        "壬丁": "正财",
        "壬戊": "七杀",
        "壬己": "正官",
        "壬庚": "偏印",
        "壬辛": "正印",
        "癸癸": "比肩",
        "癸壬": "劫财",
        "癸乙": "食神",
        "癸甲": "伤官",
        "癸丁": "偏财",
        "癸丙": "正财",
        "癸己": "七杀",
        "癸戊": "正官",
        "癸辛": "偏印",
        "癸庚": "正印"
    }

    SHI_SHEN_ZHI = {
        "甲子癸": "正印",
        "甲丑癸": "正印",
        "甲丑己": "正财",
        "甲丑辛": "正官",
        "甲寅丙": "食神",
        "甲寅甲": "比肩",
        "甲寅戊": "偏财",
        "甲卯乙": "劫财",
        "甲辰乙": "劫财",
        "甲辰戊": "偏财",
        "甲辰癸": "正印",
        "甲巳戊": "偏财",
        "甲巳丙": "食神",
        "甲巳庚": "七杀",
        "甲午丁": "伤官",
        "甲午己": "正财",
        "甲未乙": "劫财",
        "甲未己": "正财",
        "甲未丁": "伤官",
        "甲申戊": "偏财",
        "甲申庚": "七杀",
        "甲申壬": "偏印",
        "甲酉辛": "正官",
        "甲戌辛": "正官",
        "甲戌戊": "偏财",
        "甲戌丁": "伤官",
        "甲亥壬": "偏印",
        "甲亥甲": "比肩",
        "乙子癸": "偏印",
        "乙丑癸": "偏印",
        "乙丑己": "偏财",
        "乙丑辛": "七杀",
        "乙寅丙": "伤官",
        "乙寅甲": "劫财",
        "乙寅戊": "正财",
        "乙卯乙": "比肩",
        "乙辰乙": "比肩",
        "乙辰戊": "正财",
        "乙辰癸": "偏印",
        "乙巳戊": "正财",
        "乙巳丙": "伤官",
        "乙巳庚": "正官",
        "乙午丁": "食神",
        "乙午己": "偏财",
        "乙未乙": "比肩",
        "乙未己": "偏财",
        "乙未丁": "食神",
        "乙申戊": "正财",
        "乙申庚": "正官",
        "乙申壬": "正印",
        "乙酉辛": "七杀",
        "乙戌辛": "七杀",
        "乙戌戊": "正财",
        "乙戌丁": "食神",
        "乙亥壬": "正印",
        "乙亥甲": "劫财",
        "丙子癸": "正官",
        "丙丑癸": "正官",
        "丙丑己": "伤官",
        "丙丑辛": "正财",
        "丙寅丙": "比肩",
        "丙寅甲": "偏印",
        "丙寅戊": "食神",
        "丙卯乙": "正印",
        "丙辰乙": "正印",
        "丙辰戊": "食神",
        "丙辰癸": "正官",
        "丙巳戊": "食神",
        "丙巳丙": "比肩",
        "丙巳庚": "偏财",
        "丙午丁": "劫财",
        "丙午己": "伤官",
        "丙未乙": "正印",
        "丙未己": "伤官",
        "丙未丁": "劫财",
        "丙申戊": "食神",
        "丙申庚": "偏财",
        "丙申壬": "七杀",
        "丙酉辛": "正财",
        "丙戌辛": "正财",
        "丙戌戊": "食神",
        "丙戌丁": "劫财",
        "丙亥壬": "七杀",
        "丙亥甲": "偏印",
        "丁子癸": "七杀",
        "丁丑癸": "七杀",
        "丁丑己": "食神",
        "丁丑辛": "偏财",
        "丁寅丙": "劫财",
        "丁寅甲": "正印",
        "丁寅戊": "伤官",
        "丁卯乙": "偏印",
        "丁辰乙": "偏印",
        "丁辰戊": "伤官",
        "丁辰癸": "七杀",
        "丁巳戊": "伤官",
        "丁巳丙": "劫财",
        "丁巳庚": "正财",
        "丁午丁": "比肩",
        "丁午己": "食神",
        "丁未乙": "偏印",
        "丁未己": "食神",
        "丁未丁": "比肩",
        "丁申戊": "伤官",
        "丁申庚": "正财",
        "丁申壬": "正官",
        "丁酉辛": "偏财",
        "丁戌辛": "偏财",
        "丁戌戊": "伤官",
        "丁戌丁": "比肩",
        "丁亥壬": "正官",
        "丁亥甲": "正印",
        "戊子癸": "正财",
        "戊丑癸": "正财",
        "戊丑己": "劫财",
        "戊丑辛": "伤官",
        "戊寅丙": "偏印",
        "戊寅甲": "七杀",
        "戊寅戊": "比肩",
        "戊卯乙": "正官",
        "戊辰乙": "正官",
        "戊辰戊": "比肩",
        "戊辰癸": "正财",
        "戊巳戊": "比肩",
        "戊巳丙": "偏印",
        "戊巳庚": "食神",
        "戊午丁": "正印",
        "戊午己": "劫财",
        "戊未乙": "正官",
        "戊未己": "劫财",
        "戊未丁": "正印",
        "戊申戊": "比肩",
        "戊申庚": "食神",
        "戊申壬": "偏财",
        "戊酉辛": "伤官",
        "戊戌辛": "伤官",
        "戊戌戊": "比肩",
        "戊戌丁": "正印",
        "戊亥壬": "偏财",
        "戊亥甲": "七杀",
        "己子癸": "偏财",
        "己丑癸": "偏财",
        "己丑己": "比肩",
        "己丑辛": "食神",
        "己寅丙": "正印",
        "己寅甲": "正官",
        "己寅戊": "劫财",
        "己卯乙": "七杀",
        "己辰乙": "七杀",
        "己辰戊": "劫财",
        "己辰癸": "偏财",
        "己巳戊": "劫财",
        "己巳丙": "正印",
        "己巳庚": "伤官",
        "己午丁": "偏印",
        "己午己": "比肩",
        "己未乙": "七杀",
        "己未己": "比肩",
        "己未丁": "偏印",
        "己申戊": "劫财",
        "己申庚": "伤官",
        "己申壬": "正财",
        "己酉辛": "食神",
        "己戌辛": "食神",
        "己戌戊": "劫财",
        "己戌丁": "偏印",
        "己亥壬": "正财",
        "己亥甲": "正官",
        "庚子癸": "伤官",
        "庚丑癸": "伤官",
        "庚丑己": "正印",
        "庚丑辛": "劫财",
        "庚寅丙": "七杀",
        "庚寅甲": "偏财",
        "庚寅戊": "偏印",
        "庚卯乙": "正财",
        "庚辰乙": "正财",
        "庚辰戊": "偏印",
        "庚辰癸": "伤官",
        "庚巳戊": "偏印",
        "庚巳丙": "七杀",
        "庚巳庚": "比肩",
        "庚午丁": "正官",
        "庚午己": "正印",
        "庚未乙": "正财",
        "庚未己": "正印",
        "庚未丁": "正官",
        "庚申戊": "偏印",
        "庚申庚": "比肩",
        "庚申壬": "食神",
        "庚酉辛": "劫财",
        "庚戌辛": "劫财",
        "庚戌戊": "偏印",
        "庚戌丁": "正官",
        "庚亥壬": "食神",
        "庚亥甲": "偏财",
        "辛子癸": "食神",
        "辛丑癸": "食神",
        "辛丑己": "偏印",
        "辛丑辛": "比肩",
        "辛寅丙": "正官",
        "辛寅甲": "正财",
        "辛寅戊": "正印",
        "辛卯乙": "偏财",
        "辛辰乙": "偏财",
        "辛辰戊": "正印",
        "辛辰癸": "食神",
        "辛巳戊": "正印",
        "辛巳丙": "正官",
        "辛巳庚": "劫财",
        "辛午丁": "七杀",
        "辛午己": "偏印",
        "辛未乙": "偏财",
        "辛未己": "偏印",
        "辛未丁": "七杀",
        "辛申戊": "正印",
        "辛申庚": "劫财",
        "辛申壬": "伤官",
        "辛酉辛": "比肩",
        "辛戌辛": "比肩",
        "辛戌戊": "正印",
        "辛戌丁": "七杀",
        "辛亥壬": "伤官",
        "辛亥甲": "正财",
        "壬子癸": "劫财",
        "壬丑癸": "劫财",
        "壬丑己": "正官",
        "壬丑辛": "正印",
        "壬寅丙": "偏财",
        "壬寅甲": "食神",
        "壬寅戊": "七杀",
        "壬卯乙": "伤官",
        "壬辰乙": "伤官",
        "壬辰戊": "七杀",
        "壬辰癸": "劫财",
        "壬巳戊": "七杀",
        "壬巳丙": "偏财",
        "壬巳庚": "偏印",
        "壬午丁": "正财",
        "壬午己": "正官",
        "壬未乙": "伤官",
        "壬未己": "正官",
        "壬未丁": "正财",
        "壬申戊": "七杀",
        "壬申庚": "偏印",
        "壬申壬": "比肩",
        "壬酉辛": "正印",
        "壬戌辛": "正印",
        "壬戌戊": "七杀",
        "壬戌丁": "正财",
        "壬亥壬": "比肩",
        "壬亥甲": "食神",
        "癸子癸": "比肩",
        "癸丑癸": "比肩",
        "癸丑己": "七杀",
        "癸丑辛": "偏印",
        "癸寅丙": "正财",
        "癸寅甲": "伤官",
        "癸寅戊": "正官",
        "癸卯乙": "食神",
        "癸辰乙": "食神",
        "癸辰戊": "正官",
        "癸辰癸": "比肩",
        "癸巳戊": "正官",
        "癸巳丙": "正财",
        "癸巳庚": "正印",
        "癸午丁": "偏财",
        "癸午己": "七杀",
        "癸未乙": "食神",
        "癸未己": "七杀",
        "癸未丁": "偏财",
        "癸申戊": "正官",
        "癸申庚": "正印",
        "癸申壬": "劫财",
        "癸酉辛": "偏印",
        "癸戌辛": "偏印",
        "癸戌戊": "正官",
        "癸戌丁": "偏财",
        "癸亥壬": "劫财",
        "癸亥甲": "伤官"
    }

    ZHI_HIDE_GAN = {
        "子": ["癸"],
        "丑": ["己", "癸", "辛"],
        "寅": ["甲", "丙", "戊"],
        "卯": ["乙"],
        "辰": ["戊", "乙", "癸"],
        "巳": ["丙", "庚", "戊"],
        "午": ["丁", "己"],
        "未": ["己", "丁", "乙"],
        "申": ["庚", "壬", "戊"],
        "酉": ["辛"],
        "戌": ["戊", "辛", "丁"],
        "亥": ["壬", "甲"]
    }

    def __init__(self):
        pass

    @staticmethod
    def computeAddDays(year, month, day):
        """
        计算指定日期距离基准日期的天数
        :param year: 农历年
        :param month: 农历月
        :param day: 农历日
        :return: 距离天数
        """
        y = LunarUtil.BASE_YEAR
        m = LunarUtil.BASE_MONTH
        diff = LunarUtil.getDaysOfMonth(y, m) - LunarUtil.BASE_DAY
        m = LunarUtil.nextMonth(y, m)
        while True:
            diff += LunarUtil.getDaysOfMonth(y, m)
            m = LunarUtil.nextMonth(y, m)
            if m == 1:
                y += 1
            if y == year and m == month:
                diff += day
                break
        return diff

    @staticmethod
    def getLeapMonth(year):
        """
        获取指定年份的闰月
        :param year: 年份
        :return: 闰月数字，1代表闰1月，0代表无闰月
        """
        index = year - LunarUtil.BASE_YEAR + LunarUtil.BASE_INDEX
        v = LunarUtil.LUNAR_MONTH[2 * index + 1]
        v = (v >> 4) & 0x0F
        return v

    @staticmethod
    def nextMonth(y, m):
        """
        获取指定年月的下一个月是第几月
        :param y: 农历年
        :param m: 农历月，闰月为负数
        :return: 1到12，闰月为负数
        """
        n = abs(m) + 1
        if m > 0:
            index = y - LunarUtil.BASE_YEAR + LunarUtil.BASE_INDEX
            v = LunarUtil.LUNAR_MONTH[2 * index + 1]
            v = (v >> 4) & 0x0F
            if v == m:
                n = -m
        if n == 13:
            n = 1
        return n

    @staticmethod
    def getDaysOfMonth(year, month):
        """
        获取某年某月有多少天
        :param year: 农历年
        :param month: 农历月，闰月为负数
        :return: 天数
        """
        index = year - LunarUtil.BASE_YEAR + LunarUtil.BASE_INDEX
        d = 30
        if 1 <= month <= 8:
            v = LunarUtil.LUNAR_MONTH[2 * index]
            l = month - 1
            if ((v >> l) & 0x01) == 1:
                d = 29
        elif 9 <= month <= 12:
            v = LunarUtil.LUNAR_MONTH[2 * index + 1]
            l = month - 9
            if ((v >> l) & 0x01) == 1:
                d = 29
        else:
            v = LunarUtil.LUNAR_MONTH[2 * index + 1]
            v = (v >> 4) & 0x0F
            if v != abs(month):
                d = 0
            else:
                d = 29
                for i in LunarUtil.LEAP_MONTH_YEAR:
                    if i == index:
                        d = 30
                        break
        return d

    @staticmethod
    def getTimeZhiIndex(hm):
        """
        获取HH:mm时刻的地支序号，非法的时刻返回0
        :param hm: HH:mm时刻
        :return: 地支序号，0到11
        """
        if hm is None:
            return 0
        if len(hm) > 5:
            hm = hm[0:5]
        x = 1
        for i in range(1, 22, 2):
            if (("0" if i < 10 else "") + str(i) + ":00") <= hm <= (("0" if i + 1 < 10 else "") + str(i + 1) + ":59"):
                return x
            x += 1
        return 0

    @staticmethod
    def convertTime(hm):
        """
        将HH:mm时刻转换为时辰（地支），非法的时刻返回子
        :param hm: HH:mm时刻
        :return: 时辰(地支)，如子
        """
        return LunarUtil.ZHI[LunarUtil.getTimeZhiIndex(hm) + 1]
